[{
  "content": null,
  "embeds": [
    {
      "title": "Bot Detector Information",
      "fields": [
        {
          "name": "**Is this Plugin Malicious?**",
          "value": "The only part that connects to your RuneLite client is the RuneLite plugin which is available on [Github](https://github.com/Bot-detector/bot-detector). The RuneLite developers won't allow anything that's even mildly suspect to enter the Plugin Hub - which is pretty great."
        },
        {
          "name": "**Why do I need a RuneLite client to capture OSRS names?**",
          "value": "If we could have access to the OSRS database for Hiscores - this would take far less time. However, the API for Jagex's Hiscore pulling system calls only every 1-3 seconds, which means it would take over 600 days to process every single name through the API. Basically, by the time OSRS 2 and RS4 came out we'd have only scratched the surface of processing the names into a usable format - nevermind even doing the math and other nonsense to detect who is a bot."
        },
        {
          "name": "**How do we detect who is a bot?**",
          "value": "Well, we could use a variety of different methods - the one that I chose was to group every player together that has similar stats, and if that group gets banned more frequently than other groups then it's probably likely that the rest of the group is pretty bot-like or suspicious. This could also include gold-farmers, RWTers, etc. Any group with a high ban rate is suspicious and would be reported to Tipoff@Jagex.com"
        },
        {
          "name": "**How accurate is our system?**",
          "value": "The report accuracy is changing all the time. You can always see where our current accuracy is at on our [website](https://www.osrsbotdetector.com/)."
        },
        {
          "name": "**How can I contribute to the project?**",
          "value": "There are two ways to directly contribute to the Bot Detector Project. The first is to just install and use it. The more people we have the better the training of our model is. The second is donating to our patreon. All money donated is used for server upkeep."
        },
        {
          "name": "**How can I donate to Bot Detector?**",
          "value": "We have a [patreon](https://www.patreon.com/bot_detector)!"
        }
      ]
    }
  ]
},
{
  "embeds": [
    {
      "title": "Installation and Settings",
      "color": null,
      "fields": [
        {
          "name": "**How do I install Bot Detector?**",
          "value": "Bot Detector is on the Plugin Hub for RuneLite. Click the wrench icon, click Plugin Hub, search \"Bot Detector\", click install. It will ask you to give permissions to your IP and read chat. All plugins on the hub have been vetted, your IP comes along for the ride with the Data sent to our server."
        },
        {
          "name": "How to get \"Detect\" player on Right-click?",
          "value": "Got to the settings of the plugin, check the box next to \"Right-click 'Detect' players\".\n  - It may not show in your right click menu. To resolve this restart the RuneLite client."
        },
        {
          "name": "What settings should I put on the plugin?",
          "value": "That depends on what you want to do. \n\nSend names only after logout: You should use this if your internet is slow, it cuts down on the communication to our server.\n\nSend Every 'X' minutes: This is how often the names are sent to our server if you have the previous setting unchecked. It can be as long as you want, but a minimum of 5 minutes.\n\nEnable notifications: This acts like RuneLite notifications, if you are tabbed out it notifies you when names are sent to our server.\n\nRight-click 'Detect' players: this allows you to look up players in our server with a right click.\n\nEnable Anonymous Reporting: This links your account to the names your report. If this is unchecked the only thing we track is the Names Uploaded per session. If you want to know your total reports, how many bans came out of your reports, this needs to be unchecked."
        }
      ]
    }
  ]
},
{
  "embeds": [
    {
      "title": "Plugin Stats",
      "fields": [
        {
          "name": "Where can I see the global and personal stats?",
          "value": "You can see our global stats on our [website](https://www.osrsbotdetector.com/).\nTo see your personal stats, dependant on you having disabled Anonymous Reporting, you can go to the icon on the RuneLite sidebar."
        },
        {
            "name": "Why can't I see my report statistics with Anonymous Reporting enabled?",
            "value": "We tie reports to the OSRS name of the user that submits them. With Anonymous Reporting enabled you send a shared identifier that all anonymous reporters utilize when submitting reports, so there is no way to attribute statistics to you."
          },
        {
          "name": "What do each of the stats mean?",
          "value": "Names Uploaded: Amount of names sent to our server during a single session.\nReports Made: Amount of names sent to our server all your sessions.\nConfirmed Bans: Number of confirmed bans by Jagex\nProbable Bans: Number of accounts that currently do not show up on the hiscores due to a variety of reasons (low total, actually banned but pending)\nIt is important to note that if you are doing anonymous reporting only Names Uploaded will show numbers."
        }
      ]
    }
  ]
},
{
  "embeds": [
    {
      "title": "Miscellaneous Questions",
      "fields": [
        {
          "name": "Does this replace manual in-game reporting?",
          "value": "No, reporting people in game is the best thing you can do and we urge you to continue using the in-game report feature. In-game reporting will give Jagex information to ban more players."
        },
        {
          "name": "Do I need to manually detect people within the plugin?",
          "value": "No, the plugin will scan everyone that your client renders. If the machine learning algorithm determines someone is a bot with a high threshold it will send them to Jagex. This should never be considered a replacement for the in-game reporting method."
        },
        {
          "name": "My friend shows up at a 3% mining bot, will I get him banned?",
          "value": "No, things lower than 30ish percent is the machine learning algorithm taking a wild guess. We manually curate the lists we send to Jagex, and typically only players labeled as a bot with 80%+ confidence are sent.\n**Even if a name is sent to Jagex, ultimately it is their decision to ban a player or not. We have no say in who ends up being banned.**"
        },
        {
          "name": "I trained a bunch of a skill over the weekend in one shot, will this flag me?",
          "value": "Do not worry, xp gain is not the only thing looked at. It is normal to gain a good number of xp."
        },
        {
          "name": "How can I generate heatmaps I see in the server?",
          "value": "These are patreon only perks. You can always ask for one to be made, but please consider [donating](https://www.patreon.com/bot_detector) to the project."
        },
        {
          "name": "The plugin is showing gold farmers as legitimate players, why is this?",
          "value": "Currently the machine learning algorithm is trained against bots, some gold farmers will get flagged but it isn't specifically trained for gold farmers, *yet*."
        },
        {
          "name": "What does the workflow of the plugin look like?",
          "value": "Our plugin has a complex but simple workflow when handling player data. You can find it on our [github](https://user-images.githubusercontent.com/5789682/112380944-628dc600-8cc0-11eb-8924-4e5fa7ed2c45.png)."
        },
        {
          "name": "How do I get RSN Verified",
          "value": "Use the `!link [OSRS Username]` command in <#825189024074563614>. Our bot will DM you the next steps."
        }
      ]
    }
  ]
}]
